# Петя има магазин за детски играчки. Тя получава голяма поръчка, която трябва да изпълни. С парите, които ще спечели иска да отиде на екскурзия.
# Цени на играчките:
# •	Пъзел - 2.60 лв.
# •	Говореща кукла - 3 лв.
# •	Плюшено мече - 4.10 лв.
# •	Миньон - 8.20 лв.
# •	Камионче - 2 лв.
# Ако поръчаните играчки са 50 или повече магазинът прави отстъпка 25% от общата цена.
# От спечелените пари Петя трябва да даде 10% за наема на магазина.
# Да се пресметне дали парите ще ѝ стигнат да отиде на екскурзия.
# Вход
# От конзолата се четат 6 реда:
# 1.	Цена на екскурзията - реално число в интервала [1.00 … 10000.00]
cost = float(input())
# 2.	Брой пъзели - цяло число в интервала [0… 1000]
npuz = int(input())
# 3.	Брой говорещи кукли - цяло число в интервала [0 … 1000]
ndol = int(input())
# 4.	Брой плюшени мечета - цяло число в интервала [0 … 1000]
nbear = int(input())
# 5.	Брой миньони - цяло число в интервала [0 … 1000]
nmins = int(input())
# 6.	Брой камиончета - цяло число в интервала [0 … 1000]
ntru = int(input())
ntoys = npuz + ndol + nbear + nmins + ntru
toysprice = npuz * 2.6 + ndol * 3 + nbear * 4.1 + nmins * 8.2 + ntru * 2
discount = 0
if ntoys>=50:
    discount = .25*toysprice
rent=(toysprice-discount)/10
profit = toysprice-discount-rent

# Изход
# На конзолата се отпечатва:
# •	Ако парите са достатъчни се отпечатва:
# o	"Yes! {оставащите пари} lv left."
# •	Ако парите НЕ са достатъчни се отпечатва:
# o	"Not enough money! {недостигащите пари} lv needed."
if profit>=cost:
    print(f"Yes! {(profit-cost):.2f} lv left.")
else:
    print(f"Not enough money! {(cost-profit):.2f} lv needed.")
# Резултатът трябва да се форматира до втория знак след десетичната запетая.
