# 1.	Депозирана сума – реално число в интервала [100.00 … 10000.00]
dep = float(input())
# 2.	Срок на депозита (в месеци) – цяло число в интервала [1…12]
term = int(input())
# 3.	Годишен лихвен процент – реално число в интервала [0.00 …100.00]
intRate = float(input())
# Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент. Използвайте следната формула:
# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
tot = dep + term * (dep * intRate / 100 / 12)
print(tot)
