# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# •	Пилешко меню –  10.35 лв.
price_chicken = 10.35
# •	Меню с риба – 12.40 лв.
price_fish = 12.40
# •	Вегетарианско меню  – 8.15 лв.
price_veggie = 8.15
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
factor_desert = .2
# Цената на доставка е 2.50 лв и се начислява най-накрая.
cost_delivery = 2.5
# Вход
# От конзолата се четат 3 реда:
# •	Брой пилешки менюта – цяло число в интервала [0 … 99]
qty_chicken = int(input())
# •	Брой менюта с риба – цяло число в интервала [0 … 99]
qty_fish = int(input())
# •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
qty_veggie = int(input())
cost_chicken = qty_chicken * price_chicken
cost_fish = qty_fish * price_fish
cost_veggie = qty_veggie * price_veggie
cost_food = (cost_chicken + cost_fish + cost_veggie) * (1 + factor_desert)

# Изход
# Да се отпечата на конзолата един ред:  "{цена на поръчката}"
print(round(cost_food + cost_delivery, 2))
