# Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира,
# като знаете колко е таксата за тренировки по баскетбол за период от 1 година.

# Вход
# От конзолата се четe 1 ред:
# •	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
tuition = int(input())
# •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
cost_shoes = tuition * .6
# •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
cost_clothes = cost_shoes * .8
# •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
cost_ball = cost_clothes * .25
# •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
cost_acc = cost_ball * .2
# Изход
# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
total_cost = tuition + cost_shoes + \
             cost_clothes + cost_ball + cost_acc
print(total_cost)
