# Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
# Вход
# От конзолата се четат 4 реда:
# 1.	Дължина в см – цяло число в интервала [10 … 500]
a = int(input())
# 2.	Широчина в см – цяло число в интервала [10 … 300]
b=int(input())
# 3.	Височина в см – цяло число в интервала [10… 200]
h=int(input())
# 4.	Процент  – реално число в интервала [0.000 … 100.000]
percent_full = float(input())
# Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
vol_tank = a*b*h/1000
vol_water = vol_tank*(1-percent_full/100)
# Изход
# Да се отпечата на конзолата едно число:
# •	литрите вода, които ще  събира аквариума.
print(vol_water)