# Задача 1. Басейн
# Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото.
# Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати.
# За всеки един човек от екипа трябва да се заплати такса вход.
# Трябва да имате предвид, че един чадър стига за двама души. Знае се, че само 75% от екипа искат шезлонги.
# При изчислението на броя на чадърите и шезлонгите, техният брой да се закръгли до по-голямото цяло число.
# Вход
# От конзолата се четат 4 числа:
# 1.	Първи ред – брой на хората. Цяло число в интервала [1…100]
# 2.	Втори ред – такса вход. Реално число в интервала [0.00…50.00]
# 3.	Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
# 4.	Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]
# Изход
# "{сумата за покриване на разходите} lv."
# Резултатът да се форматира до втората цифра след десетичния знак.

from math import ceil

n_people = int(input())
entry_fee = float(input())
fee_sun_chair = float(input())
fee_umbrella = float(input())

n_sun_chairs = ceil(.75 * n_people)
n_umbrellas = ceil(n_people / 2)
costs = n_people * entry_fee + n_umbrellas * fee_umbrella + n_sun_chairs * fee_sun_chair
print(f'{costs:.2f} lv.')
