# Когато пуснали билетите за Евро 2016, група запалянковци решили да си закупят.
# Билетите имат две категории с различни цени:
# •	IP – 499.99 лева.
# •	Normal – 249.99 лева.
# Запалянковците имат определен бюджет, а броят на хората в групата определя какъв процент от бюджета трябва да се задели за транспорт:
#   От 1 до 4 – 75% от бюджета.
# •	От 5 до 9 – 60% от бюджета.
# •	От 10 до 24 – 50% от бюджета.
# •	От 25 до 49 – 40% от бюджета.
# •	50 или повече – 25% от бюджета.
# Напишете програма, която да пресмята дали с останалите пари от бюджета могат да си купят билети за избраната категория.
# И колко пари ще им останат или ще са им нужни.
# Вход
# Входът се чете от конзолата и съдържа точно 3 реда:
# •	На първия ред е бюджетът – реално число в интервала [1 000.00 ... 1 000 000.00]
budget = float(input())
# •	На втория ред е категорията – "VIP" или "Normal"
cat = input()
# •	На третия ред е броят на хората в групата – цяло число в интервала [1 ... 200]
n = int(input())
tr_perc = 0
if 0 < n < 5:
    tr_perc = .75
elif n < 10:
    tr_perc = .6
elif n < 25:
    tr_perc = .5
elif n < 50:
    tr_perc = .4
elif n >= 50:
    tr_perc = .25
if cat == 'VIP':
    price = 499.99
else:
    price = 249.99

cost = n * price + tr_perc * budget
diff = abs(cost - budget)
# Изход
# Да се отпечата на конзолата един ред:
# •	Ако бюджетът е достатъчен:
# o	"Yes! You have {останалите пари на групата} leva left."
# •	Ако бюджетът НЕ Е достатъчен:
# o	"Not enough money! You need {сумата, която не достига} leva."
# Сумите трябва да са форматирани с точност до два знака след десетичната запетая.
if cost > budget:
    print(f'Not enough money! You need {diff:.2f} leva.')
else:
    print(f'Yes! You have {diff:.2f} leva left.')
