# Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета. Цените зависят от сезона.

# Вход
# Входът се чете от конзолата и съдържа точно 5 реда:
# •	На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
nhriz = int(input())
# •	На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
nrozi = int(input())
# •	На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
ntulips = int(input())
# •	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
season = input()
# •	На петия ред е посочено дали денят е празник – [Y – да / N - не]
holiday = (input() == 'Y')

# Сезон	Хризантеми	Рози	Лалета
# Пролет / Лято	2.00 лв./бр.	4.10 лв./бр.	2.50 лв./бр.
# Есен / Зима	3.75 лв./бр.	4.50 лв./бр.	4.15 лв./бр.

if season == 'Spring' or season == 'Summer':
    hriz = 2 * nhriz
    rozi = 4.10 * nrozi
    tulips = 2.50 * ntulips
elif season == 'Autumn' or season == 'Winter':
    hriz = 3.75 * nhriz
    rozi = 4.50 * nrozi
    tulips = 4.15 * ntulips
cost = hriz + rozi + tulips
ntot = nhriz + nrozi + ntulips

# В празнични дни цените на всички цветя се увеличават с 15%. Предлагат се следните отстъпки:
if holiday:
    cost = 1.15 * cost
# •	За закупени повече от 7 лалета през пролетта – 5% от цената на целият букет.
if ntulips > 7 and season == 'Spring':
    cost = .95 * cost
# •	За закупени 10 или повече рози през зимата – 10% от цената на целият букет.
if nrozi >= 10 and season == 'Winter':
    cost = .9 * cost
# •	За закупени повече от 20 цветя общо през всички сезони – 20% от цената на целият букет.
if ntot > 20:
    cost = .8 * cost

# Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
# Цената за аранжиране на букета винаги е 2лв. Напишете програма, която изчислява цената за един букет.
cost += 2
# Изход
# Да се отпечата на конзолата 1 число – цената на цветята, форматирана до вторият знак след десетичната запетая.
print(f'{(cost):.2f}')
