# Вход
# Входът се чете от конзолата и се състои от два реда:
# •	Първи ред – Бюджет – реално число в интервала [10.00...10000.00]
# •	Втори ред –  Сезон – текст "Summer" или "Winter"
budget = float(input())
season = input()

# Напишете програма, която спрямо даден бюджет и сезон да пресмята цената, локацията и мястото на настаняване за ваканция.
# Сезоните са лято и зима – "Summer" и "Winter". Локациите са – "Alaska" и "Morocco".
# Възможните места за настаняване – "Hotel", "Hut" или "Camp".
if budget <= 1000:
    nast = 'Camp'
    if season == 'Summer':
        loc = 'Alaska'
        price = .65 * budget
    elif season == 'Winter':
        loc = 'Morocco'
        price = .45 * budget
# •	При бюджет по-малък или равен от 1000лв.:
# o	Настаняване в "Camp"
# o	Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
# 	Лято – Аляска – 65% от бюджета
# 	Зима – Мароко – 45% от бюджета
elif budget <= 3000:
    nast = 'Hut'
    if season == 'Summer':
        loc = 'Alaska'
        price = .80 * budget
    elif season == 'Winter':
        loc = 'Morocco'
        price = .60 * budget
# •	При бюджет по-голям от 1000лв. и по-малък или равен от 3000лв.:
# o	Настаняване в "Hut"
# o	Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
# 	Лято – Аляска – 80% от бюджета
# 	Зима – Мароко – 60% от бюджета
elif budget > 3000:
    nast = 'Hotel'
    price = .90 * budget
    if season == 'Summer':
        loc = 'Alaska'
    elif season == 'Winter':
        loc = 'Morocco'

# •	При бюджет по-голям от 3000лв.:
# o	Настаняване в "Hotel"
# o	Според сезона локацията ще е една от следните и ще струва 90% от бюджета:
# 	Лято – Аляска
# 	Зима – Мароко
# Изход
# На конзолата трябва да се отпечатат един ред.
# "{локацията} – {мястото за настаняване} – {цената}"
# Цената трябва да е форматирана до вторият знак след десетичната запетая.
print(f'{loc} - {nast} - {price:.2f}')
