# Вход
# Входът се чете от конзолата и се състои от два реда:
# •	Първи ред – Сезон – текст "Spring", "Summer", "Autumn" или "Winter"
# •	Втори ред –  Километри на месец – реално число в интервала [10.00...20000.00]
season = input()
km = float(input())
mnt = 4
#  Напишете програма която пресмята колко пари ще изкара шофьор на ТИР за един сезон.
# На входа програмата получава през кой сезон ще работи шофьора, както и колко километра на месец ще кара.
# Един сезон е 4 месеца.
# Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:
a = int(season == 'Spring')
b = int(season == 'Summer')
c = int(season == 'Autumn')
d = int(season == 'Winter')
# 	Пролет/Есен	Лято	Зима
# км на месец <= 5000	0.75 лв./км	0.90 лв./км	1.05 лв./км
# 5000 < км на месец <= 10000	0.95 лв./км	1.10 лв./км	1.25 лв./км
# 10000 < км на месец <= 20000	1.45 лв./км – за който и да е сезон
if km <= 5000:
    rate = .75 * a + .90 * b + .75 * c + 1.05 * d
elif km <= 10000:
    rate = .95 * a + 1.1 * b + .95 * c + 1.25 * d
elif km <= 20000:
    rate = 1.45
revenue = mnt * km * rate
# След като са извадени 10% за данъци се отпечатват останалите пари.
salary = .9 * revenue

# Изход
# На конзолата трябва да се отпечатат едно число:
# •	Заплатата на шофьора след данъците, форматирана до втория знак след десетичната запетая.
print(f'{salary:.2f}')
