# В една кинозала столовете са наредени в правоъгълна форма в r реда и c колони.
# Има три вида прожекции с билети на различни цени:
# •	Premiere - премиерна прожекция, на цена 12.00 лева;
# •	Normal - стандартна прожекция, на цена 7.50 лева;
# •	Discount - прожекция за деца, ученици и студенти на намалена цена от 5.00 лева.
# Напишете програма, която чете тип прожекция (текст),
# брой редове и брой колони в залата (цели числа),
# въведени от потребителя,
# и изчислява общите приходи от билети при пълна зала.
# Резултатът да се отпечата във формат 2 знака след десетичната точка.

proj = input()
r = int(input())
c = int(input())
rev = 0
if proj == 'Premiere':
    price = 12
if proj == 'Normal':
    price = 7.50
if proj == 'Discount':
    price = 5
rev = r * c * price
print(f'{rev:.2f} leva')
