# 1.	Тръби в басейн
# Басейн с обем V има две тръби от които се пълни. Всяка тръба има определен дебит \
# (литрите вода минаващи през една тръба за един час). \
# Работникът пуска тръбите едновременно и излиза за N часа. \
# Напишете програма, която изкарва състоянието на басейна, в момента, когато работникът се върне.
# Вход
# От конзолата се четат четири реда:
# •	Първият ред съдържа числото V – Обем на басейна в литри – цяло число в интервала [1…10000].
v = int(input())
# •	Вторият ред съдържа числото P1 – дебит на първата тръба за час – цяло число в интервала [1…5000].
p1 = int(input())
# •	Третият ред съдържа числото P2 – дебит на втората тръба за час– цяло число в интервала [1…5000].
p2 = int(input())
# •	Четвъртият ред съдържа числото H – часовете които работникът отсъства – реално число в интервала [1.0…24.00]
n = float(input())
# Изход
# Да се отпечата на конзолата едно от двете възможни състояния:
# •	До колко се е запълнил басейна и коя тръба с колко процента е допринесла.
# o	"The pool is {запълненост на басейна в проценти}% full. \
# Pipe 1: {процент вода от първата тръба}%. Pipe 2: {процент вода от втората тръба}%."
# Aко басейнът се е препълнил – с колко литра е прелял за даденото време.
# o	"For {часовете, които тръбите са пълнили вода} hours the pool overflows with {литрите вода в повече} liters."
wp1 = p1 * n
wp2 = p2 * n
wv = wp1 + wp2

if wv <= v:
    x = f'The pool is {(wv / v * 100):.2f}% full. Pipe 1: {(wp1 / wv * 100):.2f}%. Pipe 2: {(wp2 / wv * 100):.2f}%.'
else:
    x = f'For {n} hours the pool overflows with {(wv - v):.2f} liters.'

print(x)
