# Георги ще има гости вечерта и решава да ги нагости с паламуд, сафрид и миди. Затова отива на рибната борса,
# за да си купи по няколко килограма. Oт конзолата се въвеждат цените в лева на скумрията и цацата.
# Също количеството на паламуд, сафрид и миди в килограми.
# Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
# •	Паламуд – 60% по-скъп от скумрията
# •	Сафрид – 80% по-скъп от цацата
# •	Миди – 7.50 лв. за килограм
# Вход
# От конзолата се четат 5 числа:
# •	Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
skum = float(input())
# •	Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
caca = float(input())
# •	Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
kg_palamud = float(input())
# •	Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
kg_safrid = float(input())
# •	Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
kg_midi = int(input())
# Изход
# Да се отпечата на конзолата едно число с плаваща запетая: колко пари ще са нужни на Георги, за да си плати сметката.
# Числото трябва да е форматирано до вторият знак след десетичната запетая (1.2457 -> 1.25).
pal = 1.6 * skum
saf = 1.8 * caca
midi = 7.5
cost = pal * kg_palamud + saf * kg_safrid + midi * kg_midi
print(f'{cost:.2f}')
