# Задача 4. Храна за домашни любимци
# Ани има два домашни любимеца - куче и котка. Напишете програма,
# която изготвя статистика за храната на домашните любимци за определен брой дни.
# Всеки ден кучето и котката изяждат различно количество от общата им храна.
# На всеки трети ден получават награда - бисквитки. Количеството на бисквитките е 10% от общо изядената храна за деня.
# Вашата програма трябва да отпечатва статистика за количеството бисквитки, които са изяли,
# колко процента от първоначалното количество обща храна са изяли
# и колко процента от изядената храна е изяло кучето и колко е изяла котката.
# Вход
# Първоначално се чете един ред:
# •	Брой дни – цяло число в диапазона [1…30]
days = int(input())
# •	Общо количество храна – реално число в диапазона [0.00…10000.00]
food = float(input())

bisdquits_eaten = 0
food_eaten = 0
food_dog = 0
food_cat = 0
# След това за всеки ден се чете:
# o	Количество изядена храна от кучето – цяло число в диапазона [10…500]
# o	Количество изядена храна от котката – цяло число в диапазона [10…500]
for i in range(1, days + 1):
    i_dog_food = int(input())
    i_cat_food = int(input())
    food_dog += i_dog_food
    food_cat += i_cat_food
    if i % 3 == 0:
        bisdquits_eaten += .1 * (i_dog_food + i_cat_food)

food_eaten = food_dog + food_cat
# Изход
# На конзолата да се отпечатват четири реда:
# •	"Total eaten biscuits: {количество изядени бисквитки}gr."
print(f'Total eaten biscuits: {round(bisdquits_eaten, 0):.0f}gr.')
# •	"{процент изядена храна}% of the food has been eaten."
print(f'{(food_eaten / food * 100):.2f}% of the food has been eaten.')
# •	"{процент изядена храна от кучето}% eaten from the dog."
print(f'{(food_dog / food_eaten * 100):.2f}% eaten from the dog.')
# •	"{процент изядена храна от котката}% eaten from the cat."
print(f'{(food_cat / food_eaten * 100):.2f}% eaten from the cat.')
# Количеството изядени бисквитки трябва да бъде закръглено до най – близкото цяло число,
# а процентът храна трябва да бъде форматиран до втората цифра след десетичния знак.
