# Задача 4. Трекинг мания
# Катерачи от цяла България се събират на групи и набелязват следващите върхове за изкачване.
# Според размера на групата, катерачите ще изкачват различни върхове.
# •	Група до 5 човека– Мусала
# •	Група от 6 до 12 – Монблан
# •	Група от 13 до 25 – Килиманджаро
# •	Група от 26 до 40 – К2
# •	Група от 41 или повече – Еверест
# Да се напише програма, която изчислява процента на катерачите изкачващи всеки връх.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на групите от катерачи – цяло число в интервала [1...1000]
n_groups = int(input())
n_musala = 0
n_montblamc = 0
n_kilimandjaro = 0
n_k2 = 0
n_everest = 0

# •	За всяка една група на отделен ред – броя на хората в групата – цяло число в интервала [1...1000]
for i in range(n_groups):
    m = int(input())  # group members
    if m > 40:
        n_everest += m
    elif m > 25:
        n_k2 += m
    elif m > 12:
        n_kilimandjaro += m
    elif m > 5:
        n_montblamc += m
    elif m > 0:
        n_musala += m
all_climbers = n_musala + n_montblamc + n_kilimandjaro + n_k2 + n_everest

# Изход
# Да се отпечатат на конзолата 5 реда,
# всеки от които съдържа процент между 0.00% и 100.00% с точност до втората цифра след десетичната запетая.
# •	Първи ред - процентът изкачващи Мусала
print(f'{(n_musala / all_climbers * 100):.2f}%')
# •	Втори ред – процентът изкачващи Монблан
print(f'{(n_montblamc / all_climbers * 100):.2f}%')
# •	Трети ред – процентът изкачващи Килиманджаро
print(f'{(n_kilimandjaro / all_climbers * 100):.2f}%')
# •	Четвърти ред – процентът изкачващи К2
print(f'{(n_k2 / all_climbers * 100):.2f}%')
# •	Пети ред – процентът изкачващи Еверест
print(f'{(n_everest / all_climbers * 100):.2f}%')
