# Задача 5. Грижи за кученце
# Ани намира кученце, за което ще се грижи, докато се намери някой да го осинови.
# То изяжда дневно определено количество храна.
#
# Да се напише програма, която проверява дали количеството храна, което е закупено за кученцето,
# ще е достатъчно докато кученцето бъде осиновено.
# Вход
# От конзолата се прочитат:
# •	Закупеното количество храна за кученцето в килограми – цяло число в интервала [1 …100]
food = int(input())  # kg
food *= 1000  # gr
# •	На всеки следващ ред до получаване на команда Adopted ще получавате колко грама изяжда кученцето на всяко хранене
# - цяло число в интервала [10 …1000]
food_eaten = 0
ration = input()  # gr
while ration != 'Adopted':
    food_eaten += int(ration)
    ration = input()  # gr

diff = abs(food - food_eaten)
# Изход
# На конзолата се отпечатва 1 ред:
# •	Ако количеството храна е достатъчно да се отпечата:
if food >= food_eaten:
    print(f"Food is enough! Leftovers: {diff} grams.")
# •	Ако количеството храна не е достатъчно да се отпечата:
else:
    print(f"Food is not enough. You need {diff} grams more.")
